name: "tracking"
backend: "python"
max_batch_size: 32
input [
{
    name: "detections"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
},
{
    name: "frame"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
}
]

output [
{
    name: "tracks"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
}
]

instance_group [{ kind: KIND_CPU }]
