name: "detection_preprocessing"
backend: "python"
max_batch_size: 32
input [
{
    name: "detection_preprocessing_input"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
}
]

output [
{
    name: "detection_preprocessing_output"
    data_type: TYPE_FP32
    dims: [ 3, 640, 640 ]
}
]

instance_group [{ kind: KIND_CPU }]
